# Sample ResourceBundle properties file

Close_Help...=Close Help...

p08=Al acceder a la opcion de configuracion, sobre el \u00e1rea de trabajo \naparece un menu contextual, el cual se divide en dos partes\:\nuna para parametros de Pruning o poda y otra para Training Set\no conjunto de entrenamiento.\n\nEn pruning en analista tiene la posibilidad de configurar un minimo \nde registros por nodo y tambien debera suministrar un umbral que \npermitira detener la poda de un nodo determinado.\n\nEl analista debera tambien brindar el tam\u00f1o del conjunto de \nentrenamiento.\n\nTodos los parametros estan en terminos de porcentaje.\ndel algoritmo.\n\n\nLa ejecucion de todos los algoritmos es similar, \naccediendo a la opcion Run del menu contextual.

Algorithm_Mate=Algorithm Mate

p07=Al ejecutar el algoritmo, su icono cambiara por una animaci\u00f3n, \nas\u00ed como se muestra en B, lo cual indica que el proceso esta \nen ejecucion.\n\nEl tiempo de ejecucion, es proporcional al tam\u00f1o de la base de \ndatos y al numero y tipo de  procesos que dicho algoritmo involucre.\n

p06=Al liberar el icono del arera A en el area de trabajo B. es posible conectar los iconos\npor medio de un hilo.\n\nAl hacer click derecho sobre el icono aparece un menu emergente, \nel cual consta de las siguientes opciones\:\n\nLa opci\u00f2n Delete, borra el algoritmo del area de trabajo. \n\nLa opcion Configure, adapta los parametros del algoritmo a las necesidades \ndel analista\n\nLa opcion Run ejecuta la aplicacin del algoritmo.\n\n\nLa configuracion del algoritmo es similar en todos los algoritmos de \nClasificacion, se realiza de la siguiente manera\:

p05=Mate es un algoritmo de Clasificaci\u00f3n\nLa Clasificaci\u00f3n de datos es un proceso de dos pasos\:\nEn el primero, se construye un modelo con basa en un c\nonjunto de datos  denominado conjunto de entrenamiento.\nEn el conjunto de entrenamiento, cada tupla se asume que \npertenece a una clase predefinida, determinada por un \natributo clase.\nPor esto, la clasificaci\u00f3n es un aprendizaje supervizado\nEl resto de atributos se denominan atributos condici\u00f3n.\nEn el segundo, el modelo inicialmente se prueba con otro \nconjunto de datos denominado conjunto de prueba\n\nMate  El operador Mate genera, por cada una de las tuplas de \nuna relaci\u00f3n, todas los posibles combinaciones formadas por \nlos valores no nulos de los atributos pertenecientes a una lista \nde atributos denominados Atributos Condici\u00f3n, y el valor no \nnulo del atributo denominado Atributo Clase.\n\nMate toma como entrada cada tupla de R y produce una nueva \nrelaci\u00f3n cuyo esquema esta formado por los atributos condici\u00f3n, \nlista atributos condici\u00f3n y el atributo clase, atributo clase con \ntuplas formadas por todas las posibles combinaciones de cada \nuno de los atributos condici\u00f3n con el atributo clase, los dem\u00e1s \nvalores de los atributos se hacen nulos.\n\nMate empareja en cada partici\u00f3n todos los atributos condici\u00f3n \ncon el atributo clase, lo que facilita el conteo y el posterior c\u00e1lculo de \nlas medidas de entrop\u00eda y la ganancia de informaci\u00f3n. \nEl operador Mate genera estas combinaciones, en una sola pasada \nsobre la tabla de entrenamiento (lo que redunda en la e\ufb01ciencia \ndel proceso de construcci\u00f3n del \u00e1rbol de decisi\u00f3n).\n\nLa exactitud del modelo se calcula de acuerdo al porcentaje de\nejemplos de prueba que son correctamente clasificados.\n\nla conexion con otros componentes drag and drop, es similar \nen todos los algoritmos, y se realiza como se muestra a continuacion. 

p04=Al acceder a la opcion de configuracion, sobre el \u00e1rea de trabajo \naparece un menu contextual, el cual se divide en dos partes\:\nuna para parametros de Pruning o poda y otra para Training Set\no conjunto de entrenamiento.\n\nEn pruning en analista tiene la posibilidad de configurar un minimo \nde registros por nodo y tambien debera suministrar un umbral que \npermitira detener la poda de un nodo determinado.\n\nEl analista debera tambien brindar el tam\u00f1o del conjunto de \nentrenamiento.\n\nTodos los parametros estan en terminos de porcentaje.\ndel algoritmo.\n\n\nLa ejecucion de todos los algoritmos es similar, \naccediendo a la opcion Run del menu contextual.

Algorithm_C4-5=Algorithm C4-5

p03=Al ejecutar el algoritmo, su icono cambiara por una animaci\u00f3n, \nas\u00ed como se muestra en B, lo cual indica que el proceso esta \nen ejecucion.\n\nEl tiempo de ejecucion, es proporcional al tam\u00f1o de la base de \ndatos y al numero y tipo de  procesos que dicho algoritmo involucre.\n

p02=Al liberar el icono del arera A en el area de trabajo B. es posible conectar los iconos\npor medio de un hilo.\n\nAl hacer click derecho sobre el icono aparece un menu emergente, \nel cual consta de las siguientes opciones\:\n\nLa opci\u00f2n Delete, borra el algoritmo del area de trabajo. \n\nLa opcion Configure, adapta los parametros del algoritmo a las necesidades \ndel analista\n\nLa opcion Run ejecuta la aplicacin del algoritmo.\n\n\nLa configuracion del algoritmo es similar en todos los algoritmos de \nClasificacion, se realiza de la siguiente manera\:

p01=C 4 5 es un algoritmo de Clasificaci\u00f3n\nLa Clasificaci\u00f3n de datos es un proceso de dos pasos\:\nEn el primero, se construye un modelo con basa en un c\nonjunto de datos  denominado conjunto de entrenamiento.\nEn el conjunto de entrenamiento, cada tupla se asume que \npertenece a una clase predefinida, determinada por un \natributo clase.\nPor esto, la clasificaci\u00f3n es un aprendizaje supervizado\nEl resto de atributos se denominan atributos condici\u00f3n.\nEn el segundo, el modelo inicialmente se prueba con otro \nconjunto de datos denominado conjunto de prueba.\n\nC45 construye el \u00e1rbol de arriba hacia abajo recursivamente \nutilizando la manera de \u201cdivide y conquistaras\u201d.\nEl algoritmo usa una m\u00e9trica basada en la entrop\u00eda , conocida \ncomo ganancia de informaci\u00f3n para construir el \u00e1rbol.\n\nLa exactitud del modelo se calcula de acuerdo al porcentaje de\nejemplos de prueba que son correctamente clasificados.\n\nla conexion con otros componentes drag and drop, es similar \nen todos los algoritmos, y se realiza como se muestra a continuacion. 

Return_Aplication=Return Aplication
