# Sample ResourceBundle properties file

Se_muestra_el_\u00e1rbol_Weka._\n\nA_\u00e1rea_del_\u00e1rbol.\n\nB_pesta\u00f1a_para_ver_las_reglas_generadas_a_partir_del_\u00e1rbol.\n\nG_porcentaje_de_error_del_\u00e1rbol.\n\n\nTambien_se_puede_desplegar_el_men\u00fa_para_ajustes_del_\u00e1rbol._\nLas_opciones_son\:_\n\nC_\u201cCenter_on_Top_Node\u201d_el_cual_mueve_el_nodo_ra\u00edz_al_centro_de_\nla_pantalla_y_al_\u00e1rbol_consigo._\n\nD_\u201cFit_to_Screen\u201d_el_cual_ajusta_el_\u00e1rbol_al_tama\u00f1o_de_la_ventana._\n\nE_\u201cAuto_Scale\u201d_el_cual_despliega_el_\u00e1rbol_en_su_totalidad_sin_\nimportar_que_sobrepase_el_tama\u00f1o_de_la_ventana.\n\nF_\u201cSelect_Font\u201d_que_permite_seleccionar_el_tama\u00f1o_de_la_fuente_usada.\n\n\n\nVisualizacion_de_Reglas\:=Se muestra el \u00e1rbol Weka. \n\nA \u00e1rea del \u00e1rbol.\n\nB pesta\u00f1a para ver las reglas generadas a partir del \u00e1rbol.\n\nG porcentaje de error del \u00e1rbol.\n\n\nTambien se puede desplegar el men\u00fa para ajustes del \u00e1rbol. \nLas opciones son\: \n\nC \u201cCenter on Top Node\u201d el cual mueve el nodo ra\u00edz al centro de \nla pantalla y al \u00e1rbol consigo. \n\nD \u201cFit to Screen\u201d el cual ajusta el \u00e1rbol al tama\u00f1o de la ventana. \n\nE \u201cAuto Scale\u201d el cual despliega el \u00e1rbol en su totalidad sin \nimportar que sobrepase el tama\u00f1o de la ventana.\n\nF \u201cSelect Font\u201d que permite seleccionar el tama\u00f1o de la fuente usada.\n\n\n\nVisualizacion de Reglas\:

Weka_Tree=Weka Tree

p10=Las reglas generadas a partir del \u00e1rbol son mostradas.\nEsta lista puede ser ordenada de acuerdo a la columna. \nLa lista se ordena de mayor a menor o viceversa teniendo \ncomo criterio dicha columna.\n.\n

p09=Al liberar el icono en el area de trabajo. es posible conectar los iconos\npor medio de un hilo.\n\nAl hacer click derecho sobre el icono aparece un menu emergente, \nel cual consta de las siguientes opciones\:\n\nLa opci\u00f2n Delete, borra el visor del area de trabajo. \n\nLa opcion Run ejecuta la aplicacin del visor.\n\nLa opcion View despliega la ventana que permite visualizar tanto el \u00e1rbol como  \nlas reglas generadas. Sus detalles se explican a continuaci\u00f3n.\n\n\nVisualizacion del arbol grafico\:

p08=Este tipo de visor, permite generar un arbol grafico de desicion\napartir de un proceso minero de Clasificacion. .\n\nla conexion con otros componentes drag and drop, es similar \nen todos los visores, y se realiza como se muestra a continuacion. 

p07=Se despliega la ventana que contiene el \u00e1rbol en modo texto. \n\nA \u00e1rea del \u00e1rbol.\n\nB pesta\u00f1a para visualizar las reglas generadas a partir del \u00e1rbol \n\nC porcentaje de Confianza del \u00e1rbol.\n\n\nVisualizacion de Reglas\:

Text_Tree=Text Tree

p06=Las reglas generadas a partir del \u00e1rbol son mostradas.\nEsta lista puede ser ordenada de acuerdo a la columna. \nLa lista se ordena de mayor a menor o viceversa teniendo \ncomo criterio dicha columna.\n.\n

p05=Este tipo de visor, permite generar un arbol de desicion plano\napartir de un proceso minero de Clasificacion.\n\nla conexion con otros componentes drag and drop, es similar \nen todos los visores, y se realiza como se muestra a continuacion. 

p04=El anterior es el \u00e1rbol jer\u00e1rquico. Los campos de esta ventana son\:\n\nA \u00e1rea del \u00e1rbol. \n\nB botones para expandir o colapsar el \u00e1rbol.\n\nC pesta\u00f1a para visualizar las reglas generadas a partir del \u00e1rbol.\n\nD porcentaje de error del \u00e1rbol.\n\n\n\nVisualizacion de las reglas a partir de dicho arbol.

Hierarchical_Tree=Hierarchical Tree

p03=Las reglas generadas a partir del \u00e1rbol son mostradas.\nEsta lista puede ser ordenada de acuerdo a la columna. \nLa lista se ordena de mayor a menor o viceversa teniendo \ncomo criterio dicha columna.\n.\n

p02=Al liberar el icono en el area de trabajo. es posible conectar los iconos\npor medio de un hilo.\n\nAl hacer click derecho sobre el icono aparece un menu emergente, \nel cual consta de las siguientes opciones\:\n\nLa opci\u00f2n Delete, borra el visor del area de trabajo. \n\nLa opcion Run ejecuta la aplicacin del visor.\n\nLa opcion View despliega la ventana que permite visualizar tanto \nel \u00e1rbol como  las reglas generadas. Sus detalles se explican \na continuaci\u00f3n.\n\n\nVisualizacion del arbol jerarquico colapsado\:

p01=Este tipo de visor, permite generar un arbol jerarquico de desicion\napartir de un proceso minero de Clasificacion. \nEs muy util para visualizar el arbol por secciones.\n\nla conexion con otros componentes drag and drop, es similar \nen todos los visores, y se realiza como se muestra a continuacion. 

Return_Aplication=Return Aplication

Close_Help...=Cerrar la ayuda...
